package ru.mironenko.testtask;

/**
 * Created by nikita on 08.07.2017.
 */
//1. Реализовать модуль сборка анализа данных с sql.ru.
//2. система должна использовать Jsoup для скачивания страницы.
//3. Система должна запускаться раз в день. предусмотреть изменения частоты запуска.
//4. Система должна собирать данные только про вакансии java. учесть что JavaScript не подходит. как и Java Script.
//5. Данные должны храниться в базе данных.
//6. Учесть дубликаты.
//7. Учитывать время последнего запуска. если это первый запуск. то нужно собрать все объявления с начала года.
//8. в системе не должно быть вывод либо ввода информации. все настройки должны быть в файле.
//9. для вывода нужной информации использовать логгер log4j.

public class Main {
}
